[
    {
        "Name": "Tips on Building And Picking Computer Parts",
        "Image": "https://media.istockphoto.com/vectors/cartoon-pc-components-seamless-pattern-background-vector-vector-id932725594",
        "Paragraph": [
            "<b>Pick a side: Intel or AMD.</b> Do your research on which CPU has the power and specs you need for your dream build. The CPU will be the core of your PC, so your selection is a very important decision. But it’s not the only component in your computer, so don’t blow your entire budget on it.",
            "<b>Consider a cooler with thermal paste included.</b> Using thermal paste can be a messy ordeal, especially for first-time builders. It also adds an extra step to the process. If you'd like to simplify things, opt for a cooler that offers pre-applied thermal paste.",
            "<b>No socks on a carpet. Beware of static electricity.</b> A static discharge can destroy expensive components. To be safe in high-static environments, you can use an anti-static wrist strap or simply touch a metal object that’s not part of the computer before you begin work.",
            "<b>Many parts click when installed properly.</b> If you don’t hear or feel a satisfying click when implementing a cable or installing your RAM, for example, your component may not be in all the way.",
            "<b>Open each component carefully.</b> Components are fragile and can break before you even install them. Ripping open the packaging on your CPU can lead to bent pins, as an example, and any damaged component may very well result in a non-functioning build. ",
            "<b>Get your toolkit in order.</b> You don’t want to have to hold off on starting your build because you forgot to get the tools you need. You can get by with a mid-sized Phillips head screwdriver, but we also recommend getting a tool kit that has a three-pronged parts retriever that you can use to rescue screws that fall into the case. Pliers can also come in handy for stubborn screws or bolts.",
            "<b>Don’t forget to flip the switch on your power supply.</b> While you probably won’t forget that your PC needs a power supply, it can be easy for you to overlook flipping the on switch after it’s installed.",
            "<b>Prepare an OS install disk.</b> As soon as your computer is built and powers on, the first thing you need to do is install Windows or Linux. Prepare a USB boot drive in advance.",
            "<b>Make sure all your peripherals work beforehand.</b> It’s real anticlimactic to spend hours on a build just to hit power and see nothing happen, as will be the case if you try to pair it with a non-functioning monitor. And while the PC will boot even if the keyboard or mouse is bad, it won’t be much use to you. You definitely don’t want to disassemble your build piece by piece when all you needed was a different peripheral to get things going."
        ]
    },
    {
        "Name": "Parts of a Computer",
        "Image": "https://safebytes.com/wp-content/uploads/2017/03/959ed90adbf5056562ca3b6f020ce27c.gif",
        "Paragraph": [
            "<b>MOTHERBOARD</b><br/>There are three common motherboard form factors: ATX, Micro ATX, and Mini-ITX. They all vary in size and compatibility when it comes to other hardware connectivity, such as the GPU, RAM, and Serial Advanced technology Attachment (SATA) ports. SATA ports are part of the current standard of connecting storage devices into the computer. Storage devices like the hard drive, external drives, and solid-state drives all use up a SATA port each, so make sure if you plan on using a lot of storage to accommodate for each port. We tend to see people who use the PC for everyday productivity usually only needing 2 to 3 SATA ports.<br/>ATX, the most common desktop case size, allows up to 8 RAM slots, 4 GPU slots, and 12 SATA ports. The likelihood of using up every single slot for every hardware is unlikely, but always check how many slots you can use if you plan to add on extra hardware.<br/>Lastly, the bigger the motherboard you can get your hands on, the more components you can add—for instance, the ATX motherboard (the most common type) can fit up to 7 expansion slots. Expansion slots add more functionality to the computer with cards for video, sound, or network. If you plan to pack on Wi-Fi connectivity or higher graphical processing capability, make sure to buy a motherboard with enough expansion slots for your needs.<br/>The table below lists the most common form factors of motherboards, but there are other existing variances out there. Just make sure to always check specifications to see if the motherboard will fit inside the case.",
            "<b>RAM</b><br/>RAM is the computer’s short-term memory, which is essential to everyday tasks you run on a PC, such as loading applications, browsing on the internet, and running demanding programs or software. If you expect to run multiple applications, such as large spreadsheets, browsers, or programs, make sure to opt in for higher RAM. Most users opt for 8GB of RAM which probably offers the best value for great performance. For those who want to get into professional video editing, consider 16GB or more. Just remember, it is better to configure your PC to have more RAM than you might need just in case. Also, having an extra RAM is a great way to future-proof your device.",
            "<b>POWER SUPPLY</b><br/>The PSU is one of the most important components of your system because it drives electric power to run your system. Every PC component utilizes a certain amount of wattage and buying a powerful enough PSU will ensure your system’s stability and longevity.<br/>Every PSU has a wattage rating in its name, such as 500W or 750W – this determines how much power it can draw from your wall sockets to your components. Generally, more expensive and high-end components will require more power. Check out the power supply calculator to first determine your recommended PSU wattage.<br/>As with any components, power supplies also have different form factors to fit in different computer cases – ATX and ATX12V fit into full and mid-towers while Micro ATX and Mini ITX types fit into their respective cases.<br/>There are also PSU models that are non-modular, semi-modular, and fully modular. A modular PSU comes with no cables pre-attached, and this is an advantage for those who want to completely optimize cable management and space utilization by using only cables that are required for their build. The downsides of using modular PSUs are their higher cost and bigger size, which can introduce some restrictions in what case you can use.",
            "<b>STORAGE</b><br/>In order to actually run your PC, you need a place to store your operating system (OS), programs, and data when the power is off. The two storage options are the hard disk drive (HDD) and the solid state drive (SSD).<br/>HDDs are usually more affordable and come with bigger storage space, making them useful for storing large amounts of files like photos, videos, and documents. SSDs on the other hand are more expensive, but process data-reading at much higher speeds which is perfect for booting OS or applications.<br/>There are also specialized hard drives, such as the Seagate SkyHawk HDDs which support 24/7 operation and multiple video surveillance cameras. Deciding what storage you want ultimately comes down to how much data you keep and how you use it. Choosing between HDDs and SSDs can be difficult at first, but remember you can always easily install more storage after you finish your build.",
            "<b>GRAPHICS CARD</b><br/>The GPU is the processor that specializes in rendering visuals and video onto the display. If you only use the PC for basic tasks, browsing, or light entertainment, a CPU with an integrated GPU or an accelerated processing unit, such as the Ryzen 5 2400G or Ryzen 3 2200G will suffice. However, when it comes to applications or tasks that require heavy graphical processing, such as 3D visualization (from Computer Aided Design to 3D rendering programs), large display mirroring (from monitor to television screen), or entertainment, you need to invest in a GPU.<br/>When you do decide to buy a GPU, it comes down to two choices: AMD and NVIDIA. Both companies offer a wide range of GPUs from entry-level to extremely high-end units. When it comes to a high-end, professional workstation, the GPU will be the most expensive component, so do enough research with specific benchmarks, user reviews, and buying guides.",
            "<b>CPU PROCESSOR</b><br/>Deciding on the CPU first will help you narrow down your choices on the motherboard, which is the centerpiece of your hardware connectivity. CPUs have various specifications, such as cores, clock speed, threads, and cache. We will focus on the important specifications that matter most today."
        ]
    }
    
]